homemcu/stm-bare-metal/devices/display-color/ili9341+xpt2046/src/platform/stm32f407zg/dev/hal-ili9341-8080I-16bit-fsmc.c
/*
* Copyright (c) 2018 Vladimir Alemasov
* All rights reserved
*
* This program and the accompanying materials are distributed under 
* the terms of GNU General Public License version 2 
* as published by the Free Software Foundation.
*
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*/

#include "platform.h"
#include "stm32f4xx-hw.h"

//--------------------------------------------
#define	PORT_D0         GPIO_D   // PD14 <-> DB00
#define	PIN_D0          14
#define	PORT_D1         GPIO_D   // PD15 <-> DB01
#define	PIN_D1          15
#define	PORT_D2         GPIO_D   // PD0  <-> DB02
#define	PIN_D2          0
#define	PORT_D3         GPIO_D   // PD1  <-> DB03
#define	PIN_D3          1
#define	PORT_D4         GPIO_E   // PE7  <-> DB04
#define	PIN_D4          7
#define	PORT_D5         GPIO_E   // PE8  <-> DB05
#define	PIN_D5          8
#define	PORT_D6         GPIO_E   // PE9  <-> DB06
#define	PIN_D6          9
#define	PORT_D7         GPIO_E   // PE10 <-> DB07
#define	PIN_D7          10
#define	PORT_D8         GPIO_E   // PE11 <-> DB08
#define	PIN_D8          11
#define	PORT_D9         GPIO_E   // PE12 <-> DB09
#define	PIN_D9          12
#define	PORT_D10        GPIO_E   // PE13 <-> DB10
#define	PIN_D10         13
#define	PORT_D11        GPIO_E   // PE14 <-> DB11
#define	PIN_D11         14
#define	PORT_D12        GPIO_E   // PE15 <-> DB12
#define	PIN_D12         15
#define	PORT_D13        GPIO_D   // PD8  <-> DB13
#define	PIN_D13         8
#define	PORT_D14        GPIO_D   // PD9  <-> DB14
#define	PIN_D14         9
#define	PORT_D15        GPIO_D   // PD10 <-> DB15
#define	PIN_D15         10
#define	PORT_NWE        GPIO_D   // PD5  --> WR
#define	PIN_NWE         5
#define	PORT_NOE        GPIO_D   // PD4  --> RD
#define	PIN_NOE         4
#define	PORT_NE4        GPIO_G   // PG12 --> CS_M
#define	PIN_NE4         12
#define	PORT_A6         GPIO_F   // PF12 --> RS
#define	PIN_A6          12
#define	PORT_BLK        GPIO_B   // PB15 --> BLK
#define	PIN_BLK         15

//--------------------------------------------
// Asynchronous static memories: Mode 2 - NOR Flash

#define FSMC_BANK1_SUBBANK       4UL // FSMC_NE4 is used
#define FSMC_BCR        FSMC_Bank1->BTCR[((FSMC_BANK1_SUBBANK - 1) * 2)]
#define FSMC_BTR        FSMC_Bank1->BTCR[((FSMC_BANK1_SUBBANK - 1) * 2 + 1)]
#define FSMC_BWTR       FSMC_Bank1E->BWTR[(FSMC_BANK1_SUBBANK - 1)]
// HADDR[27:26] = FSMC_BANK1_SUBBANK - 1
// Memory width  |  Data address issued to the memory
// 8-bit         |  HADDR[25:0]
// 16-bit        |  HADDR[25:1] >> 1
#define ADDR_PIN_MASK   (0x1UL << (6 + 1)) // FSMC_A6 is used
#define ADDR_REG        (0x60000000UL + ((FSMC_BANK1_SUBBANK - 1) << 26))                  // PIN_A6 = 0 (command)
#define ADDR_DATA       (0x60000000UL + ((FSMC_BANK1_SUBBANK - 1) << 26) + ADDR_PIN_MASK)  // PIN_A6 = 1 (data)

static uint16_t *addr;

//--------------------------------------------
void hal_ili9341_init(void)
{
	// IO port B clock enable
	// IO port D clock enable
	// IO port E clock enable
	// IO port F clock enable
	// IO port G clock enable
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIODEN | RCC_AHB1ENR_GPIOEEN | RCC_AHB1ENR_GPIOFEN | RCC_AHB1ENR_GPIOGEN;
	// FSMC clock enable
	RCC->AHB3ENR |= RCC_AHB3ENR_FSMCEN;

	hw_cfg_pin(GPIOx(PORT_D0),   PIN_D0,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D1),   PIN_D1,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D2),   PIN_D2,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D3),   PIN_D3,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D4),   PIN_D4,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D5),   PIN_D5,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D6),   PIN_D6,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D7),   PIN_D7,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D8),   PIN_D8,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D9),   PIN_D9,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D10),  PIN_D10,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D11),  PIN_D11,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D12),  PIN_D12,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D13),  PIN_D13,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D14),  PIN_D14,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_D15),  PIN_D15,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_NWE),  PIN_NWE,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_NOE),  PIN_NOE,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_NE4),  PIN_NE4,  GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_A6),   PIN_A6,   GPIOCFG_MODE_ALT | GPIO_AF12_FSMC | GPIOCFG_OSPEED_VHIGH | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);
	hw_cfg_pin(GPIOx(PORT_BLK),  PIN_BLK,  GPIOCFG_MODE_OUT | GPIOCFG_OSPEED_VHIGH  | GPIOCFG_OTYPE_PUPD | GPIOCFG_PUPD_PUP);

	hw_set_pin(GPIOx(PORT_BLK), PIN_BLK, 1);

	// FSMC_BCR:
	// MBKEN = 1: Corresponding memory bank is enabled
	// MUXEN = 0: Address/Data nonmultiplexed
	// MTYP = 10: NOR Flash/OneNAND Flash (Mode 2)
	// MWID = 01: 16 bits
	// FACCEN = 1: Corresponding NOR Flash memory access is enabled
	// BURSTEN = 0
	// WAITPOL = 0
	// WRAPMOD = 0
	// WREN = 1: Write operations are enabled for the bank by the FSMC
	// WAITEN = 0
	// EXTMOD = 0: Mode 2
	// ASYNCWAIT = 0
	// CBURSTRW = 0
	FSMC_BCR = FSMC_BCR4_MBKEN | FSMC_BCR4_MTYP_1 | FSMC_BCR4_MWID_0 | FSMC_BCR4_FACCEN | FSMC_BCR4_WREN;

	// FSMC_BTR:
	// 1 x HCLK ~= 6 ns (168MHz)
	// 18.3.1 Display Parallel 18/16/9/8-bit Interface Timing Characteristics (8080-I system):
	// Address setup time - 0 ns
	// ADDSET = 0000: 0 x HCLK clock cycle
	// Write Control pulse L duration - 15 ns
	// DATAST = 00000100: 4 x HCLK clock cycle
	// ACCMOD = 01
	FSMC_BTR = FSMC_BTR4_DATAST_2 | FSMC_BTR4_ACCMOD_0;

	// FSMC_BWTR: irrelevant
}

//--------------------------------------------
void hal_ili9341_command(void)
{
	addr = (uint16_t *)ADDR_REG;
}

//--------------------------------------------
void hal_ili9341_data(void)
{
	addr = (uint16_t *)ADDR_DATA;
}

//--------------------------------------------
void hal_ili9341_tx(uint16_t data)
{
	*addr = data;
}
